/**
 * function: dict
 * author  : wq
 * update  : 2018/8/16 15:28
 */
export const CardTypes = [{'身份证': '身份证'}, {'--': '--'}]
export const SearchReson = [
  {'本人查询': '本人查询'}, {'贷款审批': '贷款审批'}, {'信用卡审批': '信用卡审批'},
  {'贷后管理': '贷后管理'}, {'担保资格审查': '担保资格审查'}, {'特约商户实名查询': '特约商户实名查询'},
  {'法人代表、负责人、高管等资信审查': '法人代表、负责人、高管等资信审查'},
  {'客户准入资格审查': '客户准入资格审查'}, {'保前审查': '保前审查'},
  {'保后管理': '保后管理'}, {'融资审批': '融资审批'}, {'资信审批': '资信审批'}, {'资信审查': '资信审查'},
  {'本人查询（临柜）': '本人查询（临柜）'}, {'本人查询（互联网个人信用信息服务平台）': '本人查询（互联网个人信用信息服务平台）'},
  {'特约商户实名审查': '特约商户实名审查'}, {'未知': '未知'}, {'--': '--'}
]
export const SexList = [
  {'女性': '女性'}, {'男性': '男性'}, {'未知': '未知'}, {'--': '--'}
]
export const MarriageList = [
  {'已婚': '已婚'}, {'未婚': '未婚'},
  {'离婚': '离婚'}, {'丧偶': '丧偶'}, {'--': '--'}
]
export const EductionList = [
  {'高中': '高中'}, {'中等专业学校或中等技术': '中等专业学校或中等技术'},
  {'研究生': '研究生'}, {'小学': '小学'}, {'初中': '初中'},
  {'文盲或半文盲': '文盲或半文盲'}, {'技术学校': '技术学校'},
  {'大学本科（简称“大学”）': '大学本科（简称“大学”）'},
  {'大学专科和专科学校（简称“大专”）': '大学专科和专科学校（简称“大专”）'}, {'未知': '未知'}, {'--': '--'}
]
export const DegreeList = [
  {'名誉博士': '名誉博士'}, {'博士': '博士'}, {'硕士': '硕士'}, {'学士': '学士'},
  {'其他': '其他'}, {'未知': '未知'}, {'--': '--'}
]
export const LivingConditionList = [
  {'自置': '自置'}, {'按揭': '按揭'}, {'亲属楼宇': '亲属楼宇'},
  {'集体宿舍': '集体宿舍'}, {'租房': '租房'}, {'共有宅地': '共有宅地'},
  {'其他': '其他'}, {'未知': '未知'}, {'--': '--'}
]
export const MoneyTypeList = [
  {'人民币': '人民币'}, {'美元折人民币': '美元折人民币'},
  {'澳门元': '澳门元'}, {'台币': '台币'}, {'美元': '美元'},
  {'澳大利亚元': '澳大利亚元'}, {'加拿大元': '加拿大元'},
  {'港元': '港元'}, {'日元': '日元'}, {'欧元': '欧元'},
  {'瑞士法郎': '瑞士法郎'}, {'英镑': '英镑'}, {'--': '--'}
]
export const LoanTypeList = [
  {'个人住房贷款': '个人住房贷款'}, {'个人商用房（包括商住两用）贷款': '个人商用房（包括商住两用）贷款'},
  {'个人住房公积金贷款': '个人住房公积金贷款'}, {'个人汽车贷款': '个人汽车贷款'},
  {'个人经营性贷款': '个人经营性贷款'}, {'个人助学贷款': '个人助学贷款'}, {'农户贷款': '农户贷款'},
  {'个人消费贷款': '个人消费贷款'}, {'其他贷款': '其他贷款'}, {'--': '--'}
]
export const MortgageMode = [
  {'信用/免担保': '信用/免担保'}, {'自然人保证': '自然人保证'},
  {'抵押担保': '抵押担保'}, {'质押（含保证金）担保': '质押（含保证金）担保'},
  {'组合（含保证）担保': '组合（含保证）担保'}, {'组合（不含保证）担保': '组合（不含保证）担保'},
  {'农户联保': '农户联保'}, {'其他担保': '其他担保'}, {'保证': '保证'}, {'--': '--'}
]
export const RepaymentMethod = [
  {'一次性归还': '一次性归还'}, {'不定期归还': '不定期归还'},
  {'按其他方式归还': '按其他方式归还'}, {'按半年归还': '按半年归还'},
  {'按周归还': '按周归还'}, {'按季归还': '按季归还'},
  {'按日归还': '按日归还'}, {'按年归还': '按年归还'}, {'按月归还': '按月归还'}, {'--': '--'}
]
export const UserStatusList = [
  {'正常': '正常'}, {'逾期': '逾期'}, {'结清': '结清'},
  {'呆账': '呆账'}, {'转出': '转出'}, {'核销': '核销'}, {'--': '--'}
]
export const UserStatusListDj = [
  {'正常': '正常'}, {'逾期': '逾期'}, {'呆账': '呆账'},
  {'核销': '核销'}, {'冻结': '冻结'},
  {'止付': '止付'}, {'销户': '销户'}, {'未激活': '未激活'}, {'--': '--'}
]
export const FiveLevelClassificationList = [
  {'正常': '正常'}, {'关注': '关注'}, {'次级': '次级'},
  {'可疑': '可疑'}, {'损失': '损失'}, {'未知': '未知'}, {'--': '--'}
]
export const CategoryList = [
  {'人民币账户': '人民币账户'}, {'美元账户': '美元账户'}, {'澳大利亚元账户': '澳大利亚元账户'},
  {'加拿大元账户': '加拿大元账户'}, {'港元账户': '港元账户'}, {'日元账户': '日元账户'},
  {'欧元账户': '欧元账户'}, {'瑞士法郎账户': '瑞士法郎账户'}, {'英镑账户': '英镑账户'}, {'--': '--'}
]
